app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nome", "email", "cpf", "dataNascimento", "obs", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE "clientes" SET "obs" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["obs", "Bonitão e lindão"], ["updated_at", "2018-03-10 01:47:22.833142"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)

DELETE FROM "clientes" WHERE "clientes"."id" = $1  [["id", 2]]
---
  def destroy
    @cliente.destroy